In [1]:
import numpy as np
import pandas as pd

In [5]:
dict1={'Names':['Ram','Sita','Laxman',np.nan],
     'Age':[30,31,np.nan,33],
     'City':[np.nan,'Hyd','Pune','Chennai']}
pd.DataFrame(dict1)

    Names   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [6]:
dict1={'Names':['Ram','Sita','Laxman',np.nan],
     'Age':[30,31,np.nan,33],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

    Names   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

## Method-1:

- Fill with a random number to all Null values

In [7]:
df.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [9]:
df.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [12]:
df.isnull().sum().count()

3

In [10]:
df.isna()

   Names    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

### fillna

In [14]:
df.fillna(40,inplace=True)

In [15]:
df

    Names   Age     City
0     Ram  30.0       40
1    Sita  31.0      Hyd
2  Laxman  40.0     Pune
3      40  33.0  Chennai

In [16]:
df.dtypes

Names     object
Age      float64
City      object
dtype: object

## Method-2 

### Fill the random value by using columm wise

In [17]:
############################# Read the data again ##########################

dict1={'Names':['Ram','Sita','Laxman',np.nan],
     'Age':[30,31,np.nan,33],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

    Names   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [21]:
df['Names'].fillna("Raheem",inplace=True)
df['Age'].fillna(32,inplace=True) # based on data type
df['City'].fillna("Blr",inplace=True)
df

    Names   Age     City
0     Ram  30.0      Blr
1    Sita  31.0      Hyd
2  Laxman  32.0     Pune
3  Raheem  33.0  Chennai

## Method-3

- pad 

- bfill

- backfill

- ffill

In [22]:
########################### Read the data again ########################
dict1={'Names':['Ram','Sita','Laxman',np.nan],
     'Age':[30,31,np.nan,33],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

    Names   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [26]:
print("===========original=========")
print(df)

print("=========pad============")
print(df.fillna(method='pad'))  # above value get repeted

print("============ffill==========")
print(df.fillna(method='ffill'))

print("=============bfill===========")
print(df.fillna(method='bfill'))

print("=============backfill==========")
print(df.fillna(method='backfill'))

===========original=========
    Names   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai
=========pad============
    Names   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman  31.0     Pune
3  Laxman  33.0  Chennai
============ffill==========
    Names   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman  31.0     Pune
3  Laxman  33.0  Chennai
=============bfill===========
    Names   Age     City
0     Ram  30.0      Hyd
1    Sita  31.0      Hyd
2  Laxman  33.0     Pune
3     NaN  33.0  Chennai
=============backfill==========
    Names   Age     City
0     Ram  30.0      Hyd
1    Sita  31.0      Hyd
2  Laxman  33.0     Pune
3     NaN  33.0  Chennai

In [27]:
print("===========original=========")
print(df)

print("=========pad============")
print(df.fillna(method='pad',axis=1)) # axis=1 means value will replace with row value

===========original=========
    Names   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai
=========pad============
    Names     Age     City
0     Ram    30.0     30.0
1    Sita    31.0      Hyd
2  Laxman  Laxman     Pune
3     NaN    33.0  Chennai

In [ ]:
# KNN imputed

## Method-4:

  - mean
   
  - median
    
  - mode

In [28]:
################# Read the data ######################

dict1={'Names':['Ram','Sita','Laxman',np.nan],
     'Age':[30,31,np.nan,33],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

    Names   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [30]:
mean_age=df['Age'].mean()
df['Age'].fillna(mean_age)

0    30.000000
1    31.000000
2    31.333333
3    33.000000
Name: Age, dtype: float64

In [31]:
median_age=df['Age'].median()
df['Age'].fillna(median_age)

0    30.0
1    31.0
2    31.0
3    33.0
Name: Age, dtype: float64

- Mode is use for categorical data

- Mean and median is used for numerical data